app/views/users/show.html.erb

								    <i class="fa fa-heart" aria-hidden="true" style="color: pink;"></i>
								    <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

								    <i class="fa fa-heart" aria-hidden="true"></i>
								    <%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

					  <td>
					  	<p>コメント数<%= book.book_comments.count %></p>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]