app/controllers/books_controller.rb

  def index
		@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall あれ、これがある、、、ないと思った
---
SELECT "books".* FROM "books"

  def create
		@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
		@book.user_id = current_user.id
    # 意味：user_idがnilのままだと、子モデルのbookの方が保存できない
  	if @book.save #入力されたデータをdbに保存する。
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "入門Git"], ["body", "aaa"], ["user_id", 1], ["created_at", "2021-06-20 05:37:11.496862"], ["updated_at", "2021-06-20 05:37:11.496862"]]

	def correct_user
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]