app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment = BookComment.new(book_comment_params)
    @comment.user_id = current_user.id
    @comment.book_id = @book.id
    @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["comment", "あああ"], ["created_at", "2021-06-20 05:41:04.467045"], ["updated_at", "2021-06-20 05:41:04.467045"]]

  def destroy
    @comment = BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 2], ["book_id", 1], ["LIMIT", 1]]

  def correct_user
    # コメントした本人＋ではないならリダイレクトさせるという表現がしたい
    @comment = BookComment.find(params[:id])
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]